#Generated by Fabric Compiler ( version 2022.2-Lite <build 118454> ) at Wed Aug 16 00:42:47 2023

add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/top_cpu/Io.v"
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/top_cpu/Sc_Cpu.v"
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/datapath/alu.v"
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/datapath/compu.v"
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/datapath/ext.v"
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/datapath/pc.v"
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/datapath/RegFile.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/control_unit/ctrl_unit.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/datapath/ext.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/datapath/RegFile.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/datapath/pc.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/datapath/compu.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/datapath/alu.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/top_cpu/Sc_Cpu.v"
remove_design -verilog "E:/Pango Project/Rsicv_001/Sc_cpu/src/top_cpu/Io.v"
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
add_design "E:/Pango Project/Rsicv_001/Sc_cpu/src/rtl/control_unit/ctrl_unit.v"
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -7 -package FBG484
compile -top_module soc_demo
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
report_timing 
gen_bit_stream 
